#### Import Python data science libraries

In [1]:
import pandas as pd
import sqlite3
import sql

In [2]:
# Establish sqlite3 library and create a connection
cnn = sqlite3.connect('jupyter_sql_tutorial.db')

In [3]:
# Load the SQL module to iPython
%load_ext sql

In [4]:
# Create Jupyter database for the ETL task
%sql sqlite:///jupyter_sql_tutorial.db

## Import tables from churn_clean

In [5]:
# contract = pd.read_csv('data/contract.csv')
# customer = pd.read_csv('data/customer.csv')
# job = pd.read_csv('data/job.csv')
# location = pd.read_csv('data/location.csv')
# payment = pd.read_csv('data/payment.csv')

## Import churn_clean tables into SQLite Jupyter Database

In [6]:
# Import into SQLite database
# customer.to_sql('customer', cnn)
# location.to_sql('location', cnn)
# job.to_sql('job', cnn)
# payment.to_sql('payment', cnn)

## Import tables from INTL telecom datasets

In [36]:
# intl_mobile_subscr = pd.read_csv('data/intl_mobile_subscr_clean.csv')
# int_user_gender = pd.read_csv('data/int_user_gender.csv')

## Import  INTL telecom datasets tables into SQLite Jupyter Database

In [37]:
# intl_mobile_subscr.to_sql('intl_mobile_subscr', cnn)
# int_user_gender.to_sql('int_user_gender', cnn)

C:\Users\vreed\anaconda3\lib\site-packages\pandas\core\generic.py:2663: UserWarning: The spaces in these column names will not be changed. In pandas versions < 0.14, spaces were converted to underscores.
  method=method,

In [12]:
%%sql

SELECT *
FROM contract
LIMIT 10;

 * sqlite:///jupyter_sql_tutorial.db
Done.

[(0, 1, 'Month-to-month'), (1, 2, 'One year'), (2, 3, 'Two Year')]

In [13]:
%%sql

SELECT *
FROM job
LIMIT 10;

 * sqlite:///jupyter_sql_tutorial.db
Done.

[(0, 1, 'Academic librarian'),
 (1, 2, 'Accommodation manager'),
 (2, 3, 'Accountant, chartered'),
 (3, 4, 'Accountant, chartered certified'),
 (4, 5, 'Accountant, chartered management'),
 (5, 6, 'Accountant, chartered public finance'),
 (6, 7, 'Accounting technician'),
 (7, 8, 'Actor'),
 (8, 9, 'Actuary'),
 (9, 10, 'Acupuncturist')]

In [14]:
%%sql

SELECT *
FROM location
LIMIT 10;

 * sqlite:///jupyter_sql_tutorial.db
Done.

[(0, 1, 601, 'Adjuntas', 'PR', 'Adjuntas'),
 (1, 2, 610, 'Anasco', 'PR', 'Añasco'),
 (2, 3, 647, 'Ensenada', 'PR', 'Guánica'),
 (3, 4, 652, 'Garrochales', 'PR', 'Arecibo'),
 (4, 5, 662, 'Isabela', 'PR', 'Isabela'),
 (5, 6, 667, 'Lajas', 'PR', 'Lajas'),
 (6, 7, 674, 'Manati', 'PR', 'Manatí'),
 (7, 8, 683, 'San German', 'PR', 'San Germán'),
 (8, 9, 692, 'Vega Alta', 'PR', 'Vega Alta'),
 (9, 10, 694, 'Vega Baja', 'PR', 'Vega Baja')]

In [15]:
%%sql

SELECT *
FROM payment
LIMIT 10;

 * sqlite:///jupyter_sql_tutorial.db
Done.

[(0, 1, 'Bank Transfer(automatic)'),
 (1, 2, 'Credit Card (automatic)'),
 (2, 3, 'Electronic Check'),
 (3, 4, 'Mailed Check')]

In [16]:
%%sql

SELECT
	customer_id,
	job_id
FROM customer
WHERE timezone IN ('America/Los_Angeles', 'America/New_York')
LIMIT 10;

 * sqlite:///jupyter_sql_tutorial.db
Done.

[(3, 'Chief Financial Officer'),
 (4, 'Solicitor'),
 (6, 'Chief Technology Officer'),
 (7, 'Surveyor, hydrographic'),
 (9, 'Teaching laboratory technician'),
 (10, 'Museum education officer'),
 (11, 'Teacher, special educational needs'),
 (14, 'Learning disability nurse'),
 (17, 'Applications developer'),
 (18, 'Immunologist')]

In [18]:
%%sql

SELECT
    CASE WHEN hometeam_id = 10189 THEN 'FC Schalke 04'
    WHEN hometeam_id = 9823 THEN 'FC Bayern Munich'
    ELSE 'Other' 
    END AS home_team,
    COUNT(id) AS total_matches
FROM matches_germany
GROUP BY home_team;

 * sqlite:///jupyter_sql_tutorial.db
(sqlite3.OperationalError) no such table: matches_germany
[SQL: SELECT CASE WHEN hometeam_id = 10189 THEN 'FC Schalke 04'
    WHEN hometeam_id = 9823 THEN 'FC Bayern Munich'
    ELSE 'Other'
    END AS home_team,
    COUNT(id) AS total_matches
FROM matches_germany
GROUP BY home_team;]
(Background on this error at: http://sqlalche.me/e/e3q8)

In [19]:
%%sql

SELECT 
    CASE WHEN income > 100000 THEN 'One Percenters'
    WHEN income > 50000 THEN 'Middle Class'
    ELSE 'Just Over Broke (JOB)'
    END AS social_class,
    COUNT(customer_id) AS totals
FROM customer
GROUP BY social_class
ORDER BY social_class DESC;

 * sqlite:///jupyter_sql_tutorial.db
Done.

[('One Percenters', 395),
 ('Middle Class', 2432),
 ('Just Over Broke (JOB)', 7173)]

#### CASE statements comparing column values

In [20]:
%%sql

SELECT 
	date,
	CASE WHEN home_goal > away_goal THEN 'Home win!'
        WHEN home_goal < away_goal THEN 'Home loss :(' 
        ELSE 'Tie' END AS outcome
FROM matches_spain;

 * sqlite:///jupyter_sql_tutorial.db
(sqlite3.OperationalError) no such table: matches_spain
[SQL: SELECT date, CASE WHEN home_goal > away_goal THEN 'Home win!'
        WHEN home_goal < away_goal THEN 'Home loss :('
        ELSE 'Tie' END AS outcome
FROM matches_spain;]
(Background on this error at: http://sqlalche.me/e/e3q8)

In [21]:
%%sql

SELECT 
	m.date,
	--Select the team long name column and call it 'opponent'
	t.team_long_name AS opponent, 
	-- Complete the CASE statement with an alias
	CASE WHEN m.home_goal > m.away_goal THEN 'Home win!'
        WHEN m.home_goal < m.away_goal THEN 'Home loss :('
        ELSE 'Tie' END AS outcome
FROM matches_spain AS m
-- Left join teams_spain onto matches_spain
LEFT JOIN teams_spain AS t
ON m.awayteam_id = t.team_api_id;

 * sqlite:///jupyter_sql_tutorial.db
(sqlite3.OperationalError) no such table: matches_spain
[SQL: SELECT m.date, --Select the team long name column and call it 'opponent'
	t.team_long_name AS opponent,
	-- Complete the CASE statement with an alias
	CASE WHEN m.home_goal > m.away_goal THEN 'Home win!'
        WHEN m.home_goal < m.away_goal THEN 'Home loss :('
        ELSE 'Tie' END AS outcome
FROM matches_spain AS m
-- Left join teams_spain onto matches_spain
LEFT JOIN teams_spain AS t
ON m.awayteam_id = t.team_api_id;]
(Background on this error at: http://sqlalche.me/e/e3q8)

#### CASE WHEN . . . AND then some

In [28]:
%%sql

SELECT area, age, churn,
    CASE WHEN age = 35 AND tenure > 7
        THEN 'Old and stayed'
    WHEN age = 21 AND tenure <=7
        THEN 'Young and left'
    ELSE 'Outlier' END AS churn_or_stayed,
    COUNT(customer_id) AS totals
FROM customer
WHERE age = 35 OR age = 21
GROUP BY churn;

 * sqlite:///jupyter_sql_tutorial.db
Done.

[('Urban', 21, 'No', 'Outlier', 211),
 ('Urban', 35, 'Yes', 'Old and stayed', 74)]

In [29]:
%%sql

SELECT *
FROM customer
LIMIT 5;

 * sqlite:///jupyter_sql_tutorial.db
Done.

[(0, 1, 56.251000000000005, -133.37571, 38, 'Urban', 'America/Sitka', 0, 68, 28561.99, 'Widowed', 'No', 'Male', 6.795512947000001, 172.45551899999998, 904.5361101999999, 7.9783229470000006, 10, 0, 1, 'No', 'Yes', 'Yes', 'Environmental health practitioner', 'Credit Card (automatic)', 'One year', 99927),
 (1, 2, 44.32893, -84.2408, 10446, 'Urban', 'America/Detroit', 1, 27, 21704.77, 'Married', 'Yes', 'Female', 1.156680997, 242.632554, 800.9827661, 11.69907956, 12, 0, 1, 'Yes', 'No', 'Yes', 'Programmer, multimedia', 'Bank Transfer(automatic)', 'Month-to-month', 48661),
 (2, 3, 45.35589, -123.24656999999999, 3735, 'Urban', 'America/Los_Angeles', 4, 50, 9609.57, 'Widowed', 'No', 'Female', 15.75414408, 159.947583, 2054.706961, 10.75280028, 9, 0, 1, 'Yes', 'Yes', 'No', 'Chief Financial Officer', 'Credit Card (automatic)', 'Two Year', 97148),
 (3, 4, 32.96687, -117.24798, 13863, 'Suburban', 'America/Los_Angeles', 1, 48, 18925.23, 'Married', 'No', 'Male', 17.08722662, 119.95683999999999, 2164.579412, 14.91353964, 15, 2, 0, 'Yes', 'No', 'No', 'Solicitor', 'Mailed Check', 'Two Year', 92014),
 (4, 5, 29.38012, -95.80673, 11352, 'Suburban', 'America/Chicago', 0, 83, 40074.19, 'Separated', 'Yes', 'Male', 1.6709717259999999, 149.948316, 271.49343619999996, 8.147416533, 16, 2, 1, 'No', 'Yes', 'No', 'Medical illustrator', 'Mailed Check', 'Month-to-month', 77461)]

In [34]:
%%sql

SELECT area,
    CASE WHEN age >= 40 THEN 'Older'
    WHEN age < 39 THEN 'Thirty something'
    ELSE 'Munchkin'
    END AS age_category,
    COUNT(customer_id) AS totals
FROM customer
GROUP BY age_category
LIMIT 10;

 * sqlite:///jupyter_sql_tutorial.db
Done.

[('Suburban', 'Munchkin', 130),
 ('Urban', 'Older', 6881),
 ('Urban', 'Thirty something', 2989)]

#### WHERE subqueries

In [35]:
%%sql

SELECT age, COUNT(churn)
FROM (SELECT area
      FROM customer) AS subquery;

 * sqlite:///jupyter_sql_tutorial.db
(sqlite3.OperationalError) no such column: age
[SQL: SELECT age, COUNT(churn) FROM (SELECT area
      FROM customer) AS subquery;]
(Background on this error at: http://sqlalche.me/e/e3q8)